In [84]:
import pandas as pd

df = pd.read_csv("csv/homeprices (2).csv")
df

               town  area   price
0   monroe township  2600  550000
1   monroe township  3000  565000
2   monroe township  3200  610000
3   monroe township  3600  680000
4   monroe township  4000  725000
5      west windsor  2600  585000
6      west windsor  2800  615000
7      west windsor  3300  650000
8      west windsor  3600  710000
9       robinsville  2600  575000
10      robinsville  2900  600000
11      robinsville  3100  620000
12      robinsville  3600  695000

In [85]:
dum = pd.get_dummies(df.town)
dum

    monroe township  robinsville  west windsor
0                 1            0             0
1                 1            0             0
2                 1            0             0
3                 1            0             0
4                 1            0             0
5                 0            0             1
6                 0            0             1
7                 0            0             1
8                 0            0             1
9                 0            1             0
10                0            1             0
11                0            1             0
12                0            1             0

In [86]:
merged = pd.concat([df,dum],axis='columns')
merged

               town  area   price  monroe township  robinsville  west windsor
0   monroe township  2600  550000                1            0             0
1   monroe township  3000  565000                1            0             0
2   monroe township  3200  610000                1            0             0
3   monroe township  3600  680000                1            0             0
4   monroe township  4000  725000                1            0             0
5      west windsor  2600  585000                0            0             1
6      west windsor  2800  615000                0            0             1
7      west windsor  3300  650000                0            0             1
8      west windsor  3600  710000                0            0             1
9       robinsville  2600  575000                0            1             0
10      robinsville  2900  600000                0            1             0
11      robinsville  3100  620000                0            1             0
12      robinsville  3600  695000                0            1             0

In [87]:
merged.drop('town',axis='columns', inplace = True)
merged

    area   price  monroe township  robinsville  west windsor
0   2600  550000                1            0             0
1   3000  565000                1            0             0
2   3200  610000                1            0             0
3   3600  680000                1            0             0
4   4000  725000                1            0             0
5   2600  585000                0            0             1
6   2800  615000                0            0             1
7   3300  650000                0            0             1
8   3600  710000                0            0             1
9   2600  575000                0            1             0
10  2900  600000                0            1             0
11  3100  620000                0            1             0
12  3600  695000                0            1             0

In [88]:
merged.drop('robinsville', axis='columns', inplace = True)
df = merged
df

    area   price  monroe township  west windsor
0   2600  550000                1             0
1   3000  565000                1             0
2   3200  610000                1             0
3   3600  680000                1             0
4   4000  725000                1             0
5   2600  585000                0             1
6   2800  615000                0             1
7   3300  650000                0             1
8   3600  710000                0             1
9   2600  575000                0             0
10  2900  600000                0             0
11  3100  620000                0             0
12  3600  695000                0             0

In [23]:
from sklearn.linear_model import LinearRegression

model = LinearRegression()
X = df.drop('price', axis='columns')
X

    area  monroe township  west windsor
0   2600                1             0
1   3000                1             0
2   3200                1             0
3   3600                1             0
4   4000                1             0
5   2600                0             1
6   2800                0             1
7   3300                0             1
8   3600                0             1
9   2600                0             0
10  2900                0             0
11  3100                0             0
12  3600                0             0

In [25]:
y = df.price
y

0     550000
1     565000
2     610000
3     680000
4     725000
5     585000
6     615000
7     650000
8     710000
9     575000
10    600000
11    620000
12    695000
Name: price, dtype: int64

In [26]:
model.fit(X,y)

LinearRegression()

In [30]:
model.predict([[3400,0,1]])

/Users/boyko/opt/anaconda3/lib/python3.8/site-packages/sklearn/base.py:445: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([681241.66845839])

In [31]:
# НАСКОЛЬКО ТОЧНА МОДЕЛЬ
model.score(X,y)

0.9573929037221872

In [32]:
# __________________________________________________________________________________________

In [5]:
import pandas as pd

df = pd.read_csv("csv/homeprices (2).csv")
print(df.town.unique())
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()

['monroe township' 'west windsor' 'robinsville']

In [91]:
dfle = df
dfle.town = le.fit_transform(dfle.town)
dfle

    town  area   price
0      0  2600  550000
1      0  3000  565000
2      0  3200  610000
3      0  3600  680000
4      0  4000  725000
5      2  2600  585000
6      2  2800  615000
7      2  3300  650000
8      2  3600  710000
9      1  2600  575000
10     1  2900  600000
11     1  3100  620000
12     1  3600  695000

In [92]:
X = dfle.drop('price',axis='columns').values
y = dfle.price

In [93]:
from sklearn.preprocessing import OneHotEncoder
ohe = OneHotEncoder(categories=[0])

In [94]:
from sklearn.compose import ColumnTransformer

preprocessor = ColumnTransformer(
    transformers=[
        ("cat", OneHotEncoder(categories=[[0, 1, 2]]), [0]),  
        ("num", "passthrough", [1])  
    ]
)

X_final = preprocessor.fit_transform(X)
print(X_final)

[[1.0e+00 0.0e+00 0.0e+00 2.6e+03]
 [1.0e+00 0.0e+00 0.0e+00 3.0e+03]
 [1.0e+00 0.0e+00 0.0e+00 3.2e+03]
 [1.0e+00 0.0e+00 0.0e+00 3.6e+03]
 [1.0e+00 0.0e+00 0.0e+00 4.0e+03]
 [0.0e+00 0.0e+00 1.0e+00 2.6e+03]
 [0.0e+00 0.0e+00 1.0e+00 2.8e+03]
 [0.0e+00 0.0e+00 1.0e+00 3.3e+03]
 [0.0e+00 0.0e+00 1.0e+00 3.6e+03]
 [0.0e+00 1.0e+00 0.0e+00 2.6e+03]
 [0.0e+00 1.0e+00 0.0e+00 2.9e+03]
 [0.0e+00 1.0e+00 0.0e+00 3.1e+03]
 [0.0e+00 1.0e+00 0.0e+00 3.6e+03]]

In [70]:
X = X_final
X = X[:,1:]
X

array([[0.0e+00, 0.0e+00, 2.6e+03],
       [0.0e+00, 0.0e+00, 3.0e+03],
       [0.0e+00, 0.0e+00, 3.2e+03],
       [0.0e+00, 0.0e+00, 3.6e+03],
       [0.0e+00, 0.0e+00, 4.0e+03],
       [0.0e+00, 1.0e+00, 2.6e+03],
       [0.0e+00, 1.0e+00, 2.8e+03],
       [0.0e+00, 1.0e+00, 3.3e+03],
       [0.0e+00, 1.0e+00, 3.6e+03],
       [1.0e+00, 0.0e+00, 2.6e+03],
       [1.0e+00, 0.0e+00, 2.9e+03],
       [1.0e+00, 0.0e+00, 3.1e+03],
       [1.0e+00, 0.0e+00, 3.6e+03]])

In [71]:
model.fit(X,y)

LinearRegression()

In [79]:
model.predict([[,0,2800]])

array([590775.63964739])

In [111]:
# HOMEWORK
df = pd.read_csv("csv/carprices.csv")
df = df.rename(columns={"Car Model": "model", "Sell Price($)": "price",'Age(yrs)':'age'})
df

                    model  Mileage  price  age
0                  BMW X5    69000  18000    6
1                  BMW X5    35000  34000    3
2                  BMW X5    57000  26100    5
3                  BMW X5    22500  40000    2
4                  BMW X5    46000  31500    4
5                 Audi A5    59000  29400    5
6                 Audi A5    52000  32000    5
7                 Audi A5    72000  19300    6
8                 Audi A5    91000  12000    8
9   Mercedez Benz C class    67000  22000    6
10  Mercedez Benz C class    83000  20000    7
11  Mercedez Benz C class    79000  21000    7
12  Mercedez Benz C class    59000  33000    5

In [112]:
de = pd.get_dummies(df.model)
de

    Audi A5  BMW X5  Mercedez Benz C class
0         0       1                      0
1         0       1                      0
2         0       1                      0
3         0       1                      0
4         0       1                      0
5         1       0                      0
6         1       0                      0
7         1       0                      0
8         1       0                      0
9         0       0                      1
10        0       0                      1
11        0       0                      1
12        0       0                      1

In [120]:
merged = pd.concat([df,de], axis='columns')
clean = merged.drop('model', axis='columns')
clean

    Mileage  price  age  Audi A5  BMW X5  Mercedez Benz C class
0     69000  18000    6        0       1                      0
1     35000  34000    3        0       1                      0
2     57000  26100    5        0       1                      0
3     22500  40000    2        0       1                      0
4     46000  31500    4        0       1                      0
5     59000  29400    5        1       0                      0
6     52000  32000    5        1       0                      0
7     72000  19300    6        1       0                      0
8     91000  12000    8        1       0                      0
9     67000  22000    6        0       0                      1
10    83000  20000    7        0       0                      1
11    79000  21000    7        0       0                      1
12    59000  33000    5        0       0                      1

In [121]:
df = clean.drop("Audi A5", axis='columns')
df

    Mileage  price  age  BMW X5  Mercedez Benz C class
0     69000  18000    6       1                      0
1     35000  34000    3       1                      0
2     57000  26100    5       1                      0
3     22500  40000    2       1                      0
4     46000  31500    4       1                      0
5     59000  29400    5       0                      0
6     52000  32000    5       0                      0
7     72000  19300    6       0                      0
8     91000  12000    8       0                      0
9     67000  22000    6       0                      1
10    83000  20000    7       0                      1
11    79000  21000    7       0                      1
12    59000  33000    5       0                      1

In [123]:
from sklearn.linear_model import LinearRegression

model = LinearRegression()
X = df.drop('price', axis="columns")
y = df.price
model.fit(X,y)
model.score(X,y)

0.9417050937281083

In [137]:
# ONE HOT ENCODING 
df = pd.read_csv("csv/carprices.csv")
df = df.rename(columns={"Car Model": "model", "Sell Price($)": "price",'Age(yrs)':'age'})
df

                    model  Mileage  price  age
0                  BMW X5    69000  18000    6
1                  BMW X5    35000  34000    3
2                  BMW X5    57000  26100    5
3                  BMW X5    22500  40000    2
4                  BMW X5    46000  31500    4
5                 Audi A5    59000  29400    5
6                 Audi A5    52000  32000    5
7                 Audi A5    72000  19300    6
8                 Audi A5    91000  12000    8
9   Mercedez Benz C class    67000  22000    6
10  Mercedez Benz C class    83000  20000    7
11  Mercedez Benz C class    79000  21000    7
12  Mercedez Benz C class    59000  33000    5

In [138]:
from sklearn.preprocessing import LabelEncoder
de = LabelEncoder()
df.model = de.fit_transform(df.model)
df

    model  Mileage  price  age
0       1    69000  18000    6
1       1    35000  34000    3
2       1    57000  26100    5
3       1    22500  40000    2
4       1    46000  31500    4
5       0    59000  29400    5
6       0    52000  32000    5
7       0    72000  19300    6
8       0    91000  12000    8
9       2    67000  22000    6
10      2    83000  20000    7
11      2    79000  21000    7
12      2    59000  33000    5

In [141]:
X = df.drop("price",axis="columns").values
y = df.price

In [143]:
from sklearn.preprocessing import OneHotEncoder
from sklearn.compose import ColumnTransformer

tranform = ColumnTransformer(transformers=[
    ('cat', OneHotEncoder(), [0]) # [0] - индекс столбца с категориями
        ],
        remainder='passthrough')

x_encoded = tranform.fit_transform(X)

In [144]:
x_encoded

array([[0.00e+00, 1.00e+00, 0.00e+00, 6.90e+04, 6.00e+00],
       [0.00e+00, 1.00e+00, 0.00e+00, 3.50e+04, 3.00e+00],
       [0.00e+00, 1.00e+00, 0.00e+00, 5.70e+04, 5.00e+00],
       [0.00e+00, 1.00e+00, 0.00e+00, 2.25e+04, 2.00e+00],
       [0.00e+00, 1.00e+00, 0.00e+00, 4.60e+04, 4.00e+00],
       [1.00e+00, 0.00e+00, 0.00e+00, 5.90e+04, 5.00e+00],
       [1.00e+00, 0.00e+00, 0.00e+00, 5.20e+04, 5.00e+00],
       [1.00e+00, 0.00e+00, 0.00e+00, 7.20e+04, 6.00e+00],
       [1.00e+00, 0.00e+00, 0.00e+00, 9.10e+04, 8.00e+00],
       [0.00e+00, 0.00e+00, 1.00e+00, 6.70e+04, 6.00e+00],
       [0.00e+00, 0.00e+00, 1.00e+00, 8.30e+04, 7.00e+00],
       [0.00e+00, 0.00e+00, 1.00e+00, 7.90e+04, 7.00e+00],
       [0.00e+00, 0.00e+00, 1.00e+00, 5.90e+04, 5.00e+00]])

In [146]:
X = x_encoded[:,1:]
X

array([[1.00e+00, 0.00e+00, 6.90e+04, 6.00e+00],
       [1.00e+00, 0.00e+00, 3.50e+04, 3.00e+00],
       [1.00e+00, 0.00e+00, 5.70e+04, 5.00e+00],
       [1.00e+00, 0.00e+00, 2.25e+04, 2.00e+00],
       [1.00e+00, 0.00e+00, 4.60e+04, 4.00e+00],
       [0.00e+00, 0.00e+00, 5.90e+04, 5.00e+00],
       [0.00e+00, 0.00e+00, 5.20e+04, 5.00e+00],
       [0.00e+00, 0.00e+00, 7.20e+04, 6.00e+00],
       [0.00e+00, 0.00e+00, 9.10e+04, 8.00e+00],
       [0.00e+00, 1.00e+00, 6.70e+04, 6.00e+00],
       [0.00e+00, 1.00e+00, 8.30e+04, 7.00e+00],
       [0.00e+00, 1.00e+00, 7.90e+04, 7.00e+00],
       [0.00e+00, 1.00e+00, 5.90e+04, 5.00e+00]])

In [148]:
model = LinearRegression()
model.fit(X,y)
model.score(X,y)

0.9417050937281082